       IDENTIFICATION DIVISION.
       PROGRAM-ID.
           OPEN-CUSTOMERS.
       
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CUST-FILE ASSIGN TO "CUSTOMERS.REL"
           ORGANIZATION IS RELATIVE
           ACCESS IS RANDOM
           RELATIVE KEY IS W-RECNUM.
       
       DATA DIVISION.
       FILE SECTION.
       FD  CUST-FILE EXTERNAL.
       01  CUST-REC.